{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/CovidVisualizedCountry-main/20210910/code/PHAC/log CovidVisualizedCountry PHAC.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}13 Sep 2021, 05:45:27
{txt}
{com}. 
. ***************************************************************************
. * This is "do CovidVisualizedCountry PHAC.do"
. 
. * Project: Combine and visualize international periodically updating 
. * estimates of COVID-19 at the country level (CovidVisualizedCountry)
. * Person: Farshad Pourmalek pourmalek_farshad at yahoo dotcom
. * Time (initial): 2021-04-14
. ***************************************************************************
. 
. 
.                                                                                                          ***************************
. * To change update date, find and replace all, (old), with (new) <<--           <<<--- * change update date here *
.                                                                                                          ***************************
. 
. 
.                                                                                                                                                                                                                  
.                                                                                                                                                                                                                  
. /*
> 
> PHAC = PHAC-McMaster model
> 
> Public Health Agency of Canada. Update on COVID-19 in Canada: Epidemiology and Modelling, September 3, 2021. 
> https://www.canada.ca/content/dam/phac-aspc/documents/services/diseases-maladies/coronavirus-disease-covid-19/epidemiological-economic-research-data/update-covid-19-canada-epidemiology-modelling-20210903-en.pdf
>                                                                                                                                                          
> */                                                                                                                                                                                                               
.                 
.                 
.                 
. * get digitized estimates from PHAC-McMaster model      
. 
. 
. * (a) Daily cases, national level, page 6       
.                 
.                 
. import excel using "PHAC-McMaster model 20210903 dig.xlsx", clear firstrow sheet("CAN")                 
{res}{txt}
{com}.                                                         
. * day1is20210101 
. 
. gen date = td(01jan2021)
{txt}
{com}. 
. replace date = date[_n-1] + 1 in 2/l
{txt}(304 real changes made)

{com}. 
. format date %tdDDMonCCYY
{txt}
{com}. 
. 
. rename refmean DayCasMeRaA11S01
{res}{txt}
{com}. label var DayCasMeRaA11S01 "Daily Cases mean raw PHAC reference scenario"
{txt}
{com}. 
. rename reflower DayCasLoRaA11S01
{res}{txt}
{com}. label var DayCasLoRaA11S01 "Daily Cases lower raw PHAC reference scenario"
{txt}
{com}. 
. rename refupper DayCasUpRaA11S01
{res}{txt}
{com}. label var DayCasUpRaA11S01 "Daily Cases uppwer raw PHAC reference scenario"
{txt}
{com}. 
. 
. rename bettermean DayCasMeRaA11S02
{res}{txt}
{com}. label var DayCasMeRaA11S02 "Daily Cases mean raw PHAC better scenario"
{txt}
{com}. 
. rename betterlower DayCasLoRaA11S02
{res}{txt}
{com}. label var DayCasLoRaA11S02 "Daily Cases lower raw PHAC better scenario"
{txt}
{com}. 
. rename betterupper DayCasUpRaA11S02
{res}{txt}
{com}. label var DayCasUpRaA11S02 "Daily Cases upper raw PHAC better scenario"
{txt}
{com}. 
. 
. rename worsemean DayCasMeRaA11S03
{res}{txt}
{com}. label var DayCasMeRaA11S03 "Daily Cases mean raw PHAC worse scenario"
{txt}
{com}. 
. rename worselower DayCasLoRaA11S03
{res}{txt}
{com}. label var DayCasLoRaA11S03 "Daily Cases lower raw PHAC worse scenario"
{txt}
{com}.                                                                                         
. rename worseupper DayCasUpRaA11S03
{res}{txt}
{com}. label var DayCasUpRaA11S03 "Daily Cases upper raw PHAC worse scenario"
{txt}
{com}. 
. 
.                                                 
. gen provincestate = " National"                                         
{txt}
{com}.                                                                                         
. gen loc_grand_name = "$country" 
{txt}
{com}. 
. sort loc_grand_name provincestate date
{txt}
{com}. 
. order loc_grand_name provincestate date DayCasMeRaA11S01 DayCasLoRaA11S01 DayCasUpRaA11S01 DayCasMeRaA11S02 DayCasLoRaA11S02 DayCasUpRaA11S02 DayCasMeRaA11S03 DayCasLoRaA11S03 DayCasUpRaA11S03        
{txt}
{com}. 
. keep loc_grand_name provincestate date DayCasMeRaA11S01 DayCasLoRaA11S01 DayCasUpRaA11S01 DayCasMeRaA11S02 DayCasLoRaA11S02 DayCasUpRaA11S02 DayCasMeRaA11S03 DayCasLoRaA11S03 DayCasUpRaA11S03
{txt}
{com}.         
. 
. compress                                                
  {txt}variable {bf}date{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
{txt}  (610 bytes saved)

{com}.                                                                                         
. save "CovidVisualizedCountry PHAC $country.dta", replace                                                                                
{txt}file CovidVisualizedCountry PHAC Canada.dta saved

{com}.                                                                                         
.                                                                                         
. * (b) Daily cases, provinces, page 12
. 
. 
. * British Columbia
. 
. import excel using "PHAC-McMaster model 20210903 dig.xlsx", clear firstrow sheet("BC")                  
{res}{txt}
{com}. 
. * day1is20210615
.                                 
. gen date = td(15jun2021)
{txt}
{com}. 
. replace date = date[_n-1] + 1 in 2/l
{txt}(139 real changes made)

{com}. 
. format date %tdDDMonCCYY        
{txt}
{com}. 
. 
. rename refmean DayCasMeRaA11S01
{res}{txt}
{com}. label var DayCasMeRaA11S01 "Daily Cases mean raw PHAC reference scenario"
{txt}
{com}. 
. rename reflower DayCasLoRaA11S01
{res}{txt}
{com}. label var DayCasLoRaA11S01 "Daily Cases lower raw PHAC reference scenario"
{txt}
{com}. 
. rename refupper DayCasUpRaA11S01
{res}{txt}
{com}. label var DayCasUpRaA11S01 "Daily Cases uppwer raw PHAC reference scenario"
{txt}
{com}. 
. 
. rename bettermean DayCasMeRaA11S02
{res}{txt}
{com}. label var DayCasMeRaA11S02 "Daily Cases mean raw PHAC better scenario"
{txt}
{com}. 
. rename betterlower DayCasLoRaA11S02
{res}{txt}
{com}. label var DayCasLoRaA11S02 "Daily Cases lower raw PHAC better scenario"
{txt}
{com}. 
. rename betterupper DayCasUpRaA11S02
{res}{txt}
{com}. label var DayCasUpRaA11S02 "Daily Cases upper raw PHAC better scenario"
{txt}
{com}. 
. 
. rename worsemean DayCasMeRaA11S03
{res}{txt}
{com}. label var DayCasMeRaA11S03 "Daily Cases mean raw PHAC worse scenario"
{txt}
{com}. 
. rename worselower DayCasLoRaA11S03
{res}{txt}
{com}. label var DayCasLoRaA11S03 "Daily Cases lower raw PHAC worse scenario"
{txt}
{com}.                                                                                         
. rename worseupper DayCasUpRaA11S03
{res}{txt}
{com}. label var DayCasUpRaA11S03 "Daily Cases upper raw PHAC worse scenario"
{txt}
{com}. 
. 
.                                         
. gen provincestate = "British Columbia"          
{txt}
{com}. 
. gen loc_grand_name = "$country" 
{txt}
{com}. 
. sort loc_grand_name provincestate date
{txt}
{com}. 
. order loc_grand_name provincestate date DayCasMeRaA11S01 DayCasLoRaA11S01 DayCasUpRaA11S01 DayCasMeRaA11S02 DayCasLoRaA11S02 DayCasUpRaA11S02 DayCasMeRaA11S03 DayCasLoRaA11S03 DayCasUpRaA11S03        
{txt}
{com}. 
. keep loc_grand_name provincestate date DayCasMeRaA11S01 DayCasLoRaA11S01 DayCasUpRaA11S01 DayCasMeRaA11S02 DayCasLoRaA11S02 DayCasUpRaA11S02 DayCasMeRaA11S03 DayCasLoRaA11S03 DayCasUpRaA11S03
{txt}
{com}.         
. 
. compress                                                
  {txt}variable {bf}date{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
{txt}  (280 bytes saved)

{com}.                                                                                         
. save "CovidVisualizedCountry PHAC BC.dta", replace      
{txt}file CovidVisualizedCountry PHAC BC.dta saved

{com}. 
. 
. 
. * Alberta
. 
. import excel using "PHAC-McMaster model 20210903 dig.xlsx", clear firstrow sheet("AB")                  
{res}{txt}
{com}. 
. * day1is20210615 
.                                 
. gen date = td(15jun2021) 
{txt}
{com}. 
. replace date = date[_n-1] + 1 in 2/l
{txt}(143 real changes made)

{com}. 
. format date %tdDDMonCCYY        
{txt}
{com}. 
. 
. rename refmean DayCasMeRaA11S01
{res}{txt}
{com}. label var DayCasMeRaA11S01 "Daily Cases mean raw PHAC reference scenario"
{txt}
{com}. 
. rename reflower DayCasLoRaA11S01
{res}{txt}
{com}. label var DayCasLoRaA11S01 "Daily Cases lower raw PHAC reference scenario"
{txt}
{com}. 
. rename refupper DayCasUpRaA11S01
{res}{txt}
{com}. label var DayCasUpRaA11S01 "Daily Cases uppwer raw PHAC reference scenario"
{txt}
{com}. 
. 
. rename bettermean DayCasMeRaA11S02
{res}{txt}
{com}. label var DayCasMeRaA11S02 "Daily Cases mean raw PHAC better scenario"
{txt}
{com}. 
. rename betterlower DayCasLoRaA11S02
{res}{txt}
{com}. label var DayCasLoRaA11S02 "Daily Cases lower raw PHAC better scenario"
{txt}
{com}. 
. rename betterupper DayCasUpRaA11S02
{res}{txt}
{com}. label var DayCasUpRaA11S02 "Daily Cases upper raw PHAC better scenario"
{txt}
{com}. 
. 
. rename worsemean DayCasMeRaA11S03
{res}{txt}
{com}. label var DayCasMeRaA11S03 "Daily Cases mean raw PHAC worse scenario"
{txt}
{com}. 
. rename worselower DayCasLoRaA11S03
{res}{txt}
{com}. label var DayCasLoRaA11S03 "Daily Cases lower raw PHAC worse scenario"
{txt}
{com}.                                                                                         
. rename worseupper DayCasUpRaA11S03
{res}{txt}
{com}. label var DayCasUpRaA11S03 "Daily Cases upper raw PHAC worse scenario"
{txt}
{com}. 
. 
.                                         
. gen provincestate = "Alberta"   
{txt}
{com}. 
. gen loc_grand_name = "$country" 
{txt}
{com}. 
. sort loc_grand_name provincestate date
{txt}
{com}. 
. order loc_grand_name provincestate date DayCasMeRaA11S01 DayCasLoRaA11S01 DayCasUpRaA11S01 DayCasMeRaA11S02 DayCasLoRaA11S02 DayCasUpRaA11S02 DayCasMeRaA11S03 DayCasLoRaA11S03 DayCasUpRaA11S03        
{txt}
{com}. 
. keep loc_grand_name provincestate date DayCasMeRaA11S01 DayCasLoRaA11S01 DayCasUpRaA11S01 DayCasMeRaA11S02 DayCasLoRaA11S02 DayCasUpRaA11S02 DayCasMeRaA11S03 DayCasLoRaA11S03 DayCasUpRaA11S03
{txt}
{com}.         
. 
. compress                                                
  {txt}variable {bf}date{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
{txt}  (288 bytes saved)

{com}.                                                                                         
. save "CovidVisualizedCountry PHAC AB.dta", replace      
{txt}file CovidVisualizedCountry PHAC AB.dta saved

{com}. 
. 
. 
. * Saskatchewan
. 
. import excel using "PHAC-McMaster model 20210903 dig.xlsx", clear firstrow sheet("SK")                  
{res}{txt}
{com}. 
. * day1is20210615 
.                                 
. gen date = td(15jun2021) 
{txt}
{com}. 
. replace date = date[_n-1] + 1 in 2/l
{txt}(142 real changes made)

{com}. 
. format date %tdDDMonCCYY        
{txt}
{com}. 
. 
. rename refmean DayCasMeRaA11S01
{res}{txt}
{com}. label var DayCasMeRaA11S01 "Daily Cases mean raw PHAC reference scenario"
{txt}
{com}. 
. rename reflower DayCasLoRaA11S01
{res}{txt}
{com}. label var DayCasLoRaA11S01 "Daily Cases lower raw PHAC reference scenario"
{txt}
{com}. 
. rename refupper DayCasUpRaA11S01
{res}{txt}
{com}. label var DayCasUpRaA11S01 "Daily Cases uppwer raw PHAC reference scenario"
{txt}
{com}. 
. 
. rename bettermean DayCasMeRaA11S02
{res}{txt}
{com}. label var DayCasMeRaA11S02 "Daily Cases mean raw PHAC better scenario"
{txt}
{com}. 
. rename betterlower DayCasLoRaA11S02
{res}{txt}
{com}. label var DayCasLoRaA11S02 "Daily Cases lower raw PHAC better scenario"
{txt}
{com}. 
. rename betterupper DayCasUpRaA11S02
{res}{txt}
{com}. label var DayCasUpRaA11S02 "Daily Cases upper raw PHAC better scenario"
{txt}
{com}. 
. 
. rename worsemean DayCasMeRaA11S03
{res}{txt}
{com}. label var DayCasMeRaA11S03 "Daily Cases mean raw PHAC worse scenario"
{txt}
{com}. 
. rename worselower DayCasLoRaA11S03
{res}{txt}
{com}. label var DayCasLoRaA11S03 "Daily Cases lower raw PHAC worse scenario"
{txt}
{com}.                                                                                         
. rename worseupper DayCasUpRaA11S03
{res}{txt}
{com}. label var DayCasUpRaA11S03 "Daily Cases upper raw PHAC worse scenario"
{txt}
{com}. 
. 
.                                         
. gen provincestate = "Saskatchewan"      
{txt}
{com}. 
. gen loc_grand_name = "$country" 
{txt}
{com}. 
. sort loc_grand_name provincestate date
{txt}
{com}. 
. order loc_grand_name provincestate date DayCasMeRaA11S01 DayCasLoRaA11S01 DayCasUpRaA11S01 DayCasMeRaA11S02 DayCasLoRaA11S02 DayCasUpRaA11S02 DayCasMeRaA11S03 DayCasLoRaA11S03 DayCasUpRaA11S03        
{txt}
{com}. 
. keep loc_grand_name provincestate date DayCasMeRaA11S01 DayCasLoRaA11S01 DayCasUpRaA11S01 DayCasMeRaA11S02 DayCasLoRaA11S02 DayCasUpRaA11S02 DayCasMeRaA11S03 DayCasLoRaA11S03 DayCasUpRaA11S03
{txt}
{com}.         
. 
. compress                                                
  {txt}variable {bf}date{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
{txt}  (286 bytes saved)

{com}.                                                                                         
. save "CovidVisualizedCountry PHAC SK.dta", replace      
{txt}file CovidVisualizedCountry PHAC SK.dta saved

{com}. 
. 
. 
. 
. * Manitoba
. 
. import excel using "PHAC-McMaster model 20210903 dig.xlsx", clear firstrow sheet("MB")                  
{res}{txt}
{com}. 
. * day1is20210615 
.                                 
. gen date = td(15jun2021) 
{txt}
{com}. 
. replace date = date[_n-1] + 1 in 2/l
{txt}(143 real changes made)

{com}. 
. format date %tdDDMonCCYY        
{txt}
{com}. 
. 
. rename refmean DayCasMeRaA11S01
{res}{txt}
{com}. label var DayCasMeRaA11S01 "Daily Cases mean raw PHAC reference scenario"
{txt}
{com}. 
. rename reflower DayCasLoRaA11S01
{res}{txt}
{com}. label var DayCasLoRaA11S01 "Daily Cases lower raw PHAC reference scenario"
{txt}
{com}. 
. rename refupper DayCasUpRaA11S01
{res}{txt}
{com}. label var DayCasUpRaA11S01 "Daily Cases uppwer raw PHAC reference scenario"
{txt}
{com}. 
. 
. rename bettermean DayCasMeRaA11S02
{res}{txt}
{com}. label var DayCasMeRaA11S02 "Daily Cases mean raw PHAC better scenario"
{txt}
{com}. 
. rename betterlower DayCasLoRaA11S02
{res}{txt}
{com}. label var DayCasLoRaA11S02 "Daily Cases lower raw PHAC better scenario"
{txt}
{com}. 
. rename betterupper DayCasUpRaA11S02
{res}{txt}
{com}. label var DayCasUpRaA11S02 "Daily Cases upper raw PHAC better scenario"
{txt}
{com}. 
. 
. rename worsemean DayCasMeRaA11S03
{res}{txt}
{com}. label var DayCasMeRaA11S03 "Daily Cases mean raw PHAC worse scenario"
{txt}
{com}. 
. rename worselower DayCasLoRaA11S03
{res}{txt}
{com}. label var DayCasLoRaA11S03 "Daily Cases lower raw PHAC worse scenario"
{txt}
{com}.                                                                                         
. rename worseupper DayCasUpRaA11S03
{res}{txt}
{com}. label var DayCasUpRaA11S03 "Daily Cases upper raw PHAC worse scenario"
{txt}
{com}. 
. 
.                                         
. gen provincestate = "Manitoba"          
{txt}
{com}. 
. gen loc_grand_name = "$country" 
{txt}
{com}. 
. sort loc_grand_name provincestate date
{txt}
{com}. 
. order loc_grand_name provincestate date DayCasMeRaA11S01 DayCasLoRaA11S01 DayCasUpRaA11S01 DayCasMeRaA11S02 DayCasLoRaA11S02 DayCasUpRaA11S02 DayCasMeRaA11S03 DayCasLoRaA11S03 DayCasUpRaA11S03        
{txt}
{com}. 
. keep loc_grand_name provincestate date DayCasMeRaA11S01 DayCasLoRaA11S01 DayCasUpRaA11S01 DayCasMeRaA11S02 DayCasLoRaA11S02 DayCasUpRaA11S02 DayCasMeRaA11S03 DayCasLoRaA11S03 DayCasUpRaA11S03
{txt}
{com}.         
. 
. compress                                                
  {txt}variable {bf}date{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
{txt}  (288 bytes saved)

{com}.                                                                                         
. save "CovidVisualizedCountry PHAC MB.dta", replace      
{txt}file CovidVisualizedCountry PHAC MB.dta saved

{com}. 
.                                                         
.                                                         
.                                                         
.                                                         
. * Ontario
. 
. import excel using "PHAC-McMaster model 20210903 dig.xlsx", clear firstrow sheet("ON")                  
{res}{txt}
{com}. 
. * day1is20210615
.                                 
. gen date = td(15jun2021)
{txt}
{com}. 
. replace date = date[_n-1] + 1 in 2/l
{txt}(142 real changes made)

{com}. 
. format date %tdDDMonCCYY        
{txt}
{com}. 
. 
. rename refmean DayCasMeRaA11S01
{res}{txt}
{com}. label var DayCasMeRaA11S01 "Daily Cases mean raw PHAC reference scenario"
{txt}
{com}. 
. rename reflower DayCasLoRaA11S01
{res}{txt}
{com}. label var DayCasLoRaA11S01 "Daily Cases lower raw PHAC reference scenario"
{txt}
{com}. 
. rename refupper DayCasUpRaA11S01
{res}{txt}
{com}. label var DayCasUpRaA11S01 "Daily Cases uppwer raw PHAC reference scenario"
{txt}
{com}. 
. 
. rename bettermean DayCasMeRaA11S02
{res}{txt}
{com}. label var DayCasMeRaA11S02 "Daily Cases mean raw PHAC better scenario"
{txt}
{com}. 
. rename betterlower DayCasLoRaA11S02
{res}{txt}
{com}. label var DayCasLoRaA11S02 "Daily Cases lower raw PHAC better scenario"
{txt}
{com}. 
. rename betterupper DayCasUpRaA11S02
{res}{txt}
{com}. label var DayCasUpRaA11S02 "Daily Cases upper raw PHAC better scenario"
{txt}
{com}. 
. 
. rename worsemean DayCasMeRaA11S03
{res}{txt}
{com}. label var DayCasMeRaA11S03 "Daily Cases mean raw PHAC worse scenario"
{txt}
{com}. 
. rename worselower DayCasLoRaA11S03
{res}{txt}
{com}. label var DayCasLoRaA11S03 "Daily Cases lower raw PHAC worse scenario"
{txt}
{com}.                                                                                         
. rename worseupper DayCasUpRaA11S03
{res}{txt}
{com}. label var DayCasUpRaA11S03 "Daily Cases upper raw PHAC worse scenario"
{txt}
{com}. 
. 
.                                         
. gen provincestate = "Ontario"   
{txt}
{com}. 
. gen loc_grand_name = "$country"         
{txt}
{com}. 
. sort loc_grand_name provincestate date
{txt}
{com}. 
. order loc_grand_name provincestate date DayCasMeRaA11S01 DayCasLoRaA11S01 DayCasUpRaA11S01 DayCasMeRaA11S02 DayCasLoRaA11S02 DayCasUpRaA11S02 DayCasMeRaA11S03 DayCasLoRaA11S03 DayCasUpRaA11S03        
{txt}
{com}. 
. keep loc_grand_name provincestate date DayCasMeRaA11S01 DayCasLoRaA11S01 DayCasUpRaA11S01 DayCasMeRaA11S02 DayCasLoRaA11S02 DayCasUpRaA11S02 DayCasMeRaA11S03 DayCasLoRaA11S03 DayCasUpRaA11S03
{txt}
{com}.         
. 
. compress                                                
  {txt}variable {bf}date{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
{txt}  (286 bytes saved)

{com}.                                                                                         
. save "CovidVisualizedCountry PHAC ON.dta", replace      
{txt}file CovidVisualizedCountry PHAC ON.dta saved

{com}. 
. 
. 
. 
. * Quebec
. 
. import excel using "PHAC-McMaster model 20210903 dig.xlsx", clear firstrow sheet("QC")                  
{res}{txt}
{com}. 
. * day1is20210615 
.                                 
. gen date = td(15jun2021) 
{txt}
{com}. 
. replace date = date[_n-1] + 1 in 2/l
{txt}(141 real changes made)

{com}. 
. format date %tdDDMonCCYY        
{txt}
{com}. 
. 
. rename refmean DayCasMeRaA11S01
{res}{txt}
{com}. label var DayCasMeRaA11S01 "Daily Cases mean raw PHAC reference scenario"
{txt}
{com}. 
. rename reflower DayCasLoRaA11S01
{res}{txt}
{com}. label var DayCasLoRaA11S01 "Daily Cases lower raw PHAC reference scenario"
{txt}
{com}. 
. rename refupper DayCasUpRaA11S01
{res}{txt}
{com}. label var DayCasUpRaA11S01 "Daily Cases uppwer raw PHAC reference scenario"
{txt}
{com}. 
. 
. rename bettermean DayCasMeRaA11S02
{res}{txt}
{com}. label var DayCasMeRaA11S02 "Daily Cases mean raw PHAC better scenario"
{txt}
{com}. 
. rename betterlower DayCasLoRaA11S02
{res}{txt}
{com}. label var DayCasLoRaA11S02 "Daily Cases lower raw PHAC better scenario"
{txt}
{com}. 
. rename betterupper DayCasUpRaA11S02
{res}{txt}
{com}. label var DayCasUpRaA11S02 "Daily Cases upper raw PHAC better scenario"
{txt}
{com}. 
. 
. rename worsemean DayCasMeRaA11S03
{res}{txt}
{com}. label var DayCasMeRaA11S03 "Daily Cases mean raw PHAC worse scenario"
{txt}
{com}. 
. rename worselower DayCasLoRaA11S03
{res}{txt}
{com}. label var DayCasLoRaA11S03 "Daily Cases lower raw PHAC worse scenario"
{txt}
{com}.                                                                                         
. rename worseupper DayCasUpRaA11S03
{res}{txt}
{com}. label var DayCasUpRaA11S03 "Daily Cases upper raw PHAC worse scenario"
{txt}
{com}. 
. 
.                                         
. gen provincestate = "Quebec"            
{txt}
{com}. 
. gen loc_grand_name = "$country"         
{txt}
{com}. 
. sort loc_grand_name provincestate date
{txt}
{com}. 
. order loc_grand_name provincestate date DayCasMeRaA11S01 DayCasLoRaA11S01 DayCasUpRaA11S01 DayCasMeRaA11S02 DayCasLoRaA11S02 DayCasUpRaA11S02 DayCasMeRaA11S03 DayCasLoRaA11S03 DayCasUpRaA11S03        
{txt}
{com}. 
. keep loc_grand_name provincestate date DayCasMeRaA11S01 DayCasLoRaA11S01 DayCasUpRaA11S01 DayCasMeRaA11S02 DayCasLoRaA11S02 DayCasUpRaA11S02 DayCasMeRaA11S03 DayCasLoRaA11S03 DayCasUpRaA11S03
{txt}
{com}.         
. 
. compress                                                
  {txt}variable {bf}date{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
{txt}  (284 bytes saved)

{com}.                                                                                         
. save "CovidVisualizedCountry PHAC QC.dta", replace      
{txt}file CovidVisualizedCountry PHAC QC.dta saved

{com}. 
. 
. *
. 
. 
. 
. 
. * (c) Daily hospitalization, national level, page 7     
.                 
.                 
. import excel using "PHAC-McMaster model 20210903 dig.xlsx", clear firstrow sheet("hospitalization")                     
{res}{txt}
{com}.                                                         
. * day1is20200215
. 
. gen date = td(15feb2020)
{txt}
{com}. 
. replace date = date[_n-1] + 1 in 2/l
{txt}(1,065 real changes made)

{com}. 
. format date %tdDDMonCCYY        
{txt}
{com}. 
. 
. 
. rename refmean DayHosMeRaA11S01 
{res}{txt}
{com}. 
. label var DayHosMeRaA11S01 "Daily Hospitalized cases per 100K pop raw reference scenario"
{txt}
{com}. 
. rename bettermean DayHosMeRaA11S02 
{res}{txt}
{com}. 
. label var DayHosMeRaA11S02 "Daily Hospitalized cases per 100K pop raw better scenario"
{txt}
{com}. 
. rename bedcapacity DayCapMeRaA11S00
{res}{txt}
{com}. 
. label var DayCapMeRaA11S00 "Hospital capacity for C-19 patients per 100K pop"
{txt}
{com}. 
. 
. * smooth 
. 
. tsset date, daily   
{res}{txt}{col 9}time variable:  {res}{col 25}date, 15Feb2020 to 15Jan2023
{txt}{col 17}delta:  {res}1 day
{txt}
{com}. 
. tssmooth ma DayHosMeRaA11S01_window = DayHosMeRaA11S01, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayHosMeRaA11S01{p_end}
{txt}
{com}. 
. tssmooth ma DayHosMeSmA11S01 = DayHosMeRaA11S01_window, weights(1 2 3 4 5 <6> 5 4 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5}(1/36)*[1*x(t-5) + 2*x(t-4) + 3*x(t-3) + 4*x(t-2) + 5*x(t-1) + 6*x(t) + 5*x(t+1) + 4*x(t+2) + 3*x(t+3) + 2*x(t+4) + ...; x(t)= DayHosMeRaA11S01_window
{txt}
{smcl}
{com}. 
. label var DayHosMeSmA11S01 "Daily Hospitalized cases per 100K pop smooth reference scenario"
{txt}
{com}. 
. drop DayHosMeRaA11S01_window
{txt}
{com}. 
. 
. tssmooth ma DayHosMeRaA11S02_window = DayHosMeRaA11S02, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayHosMeRaA11S02{p_end}
{txt}
{com}. 
. tssmooth ma DayHosMeSmA11S02 = DayHosMeRaA11S02_window, weights(1 2 3 4 5 <6> 5 4 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5}(1/36)*[1*x(t-5) + 2*x(t-4) + 3*x(t-3) + 4*x(t-2) + 5*x(t-1) + 6*x(t) + 5*x(t+1) + 4*x(t+2) + 3*x(t+3) + 2*x(t+4) + ...; x(t)= DayHosMeRaA11S02_window
{txt}
{smcl}
{com}. 
. label var DayHosMeSmA11S02 "Daily Hospitalized cases per 100K pop smooth better scenario"
{txt}
{com}. 
. drop DayHosMeRaA11S02_window
{txt}
{com}. 
. tsset, clear
{txt}
{com}. 
. 
. 
. gen provincestate = " National"                                         
{txt}
{com}.                                                                                         
. gen loc_grand_name = "$country" 
{txt}
{com}. 
. sort loc_grand_name provincestate date
{txt}
{com}. 
. order loc_grand_name provincestate date DayHosMeRaA11S01 DayHosMeSmA11S01 DayHosMeRaA11S02 DayHosMeSmA11S02 DayCapMeRaA11S00
{txt}
{com}. 
. keep loc_grand_name provincestate date DayHosMeRaA11S01 DayHosMeSmA11S01 DayHosMeRaA11S02 DayHosMeSmA11S02 DayCapMeRaA11S00
{txt}
{com}.         
. 
. compress                                                
  {txt}variable {bf}date{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
{txt}  (2,132 bytes saved)

{com}.                                                                                         
. save "CovidVisualizedCountry PHAC $country Hospitalized.dta", replace   
{txt}file CovidVisualizedCountry PHAC Canada Hospitalized.dta saved

{com}. 
. 
. 
. 
. * combine
. 
. 
. use "CovidVisualizedCountry PHAC $country.dta", clear
{txt}
{com}. 
. merge m:m loc_grand_name provincestate date using "CovidVisualizedCountry PHAC $country Hospitalized.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             761
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}             761{txt}  (_merge==2)

{col 5}matched{col 30}{res}             305{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. sort loc_grand_name provincestate date
{txt}
{com}. 
. append using "CovidVisualizedCountry PHAC BC.dta"                                                                               
{txt}{p 0 7 2}
(note: variable
provincestate was 
str9, now str16 to accommodate using data's values)
{p_end}

{com}. append using "CovidVisualizedCountry PHAC AB.dta"                                                                               
{txt}
{com}. append using "CovidVisualizedCountry PHAC SK.dta"                                                                               
{txt}
{com}. append using "CovidVisualizedCountry PHAC MB.dta"                                                                               
{txt}
{com}. append using "CovidVisualizedCountry PHAC ON.dta"                                                                               
{txt}
{com}. append using "CovidVisualizedCountry PHAC QC.dta"       
{txt}
{com}.                                                                         
.                                                                         
. sort loc_grand_name provincestate date
{txt}
{com}. 
. 
. gen DayCasMeRaA11S01XAB = DayCasMeRaA11S01
{txt}(831 missing values generated)

{com}. replace DayCasMeRaA11S01XAB = . if provincestate != "Alberta"
{txt}(961 real changes made, 961 to missing)

{com}. 
. gen DayCasMeRaA11S01XBC = DayCasMeRaA11S01
{txt}(831 missing values generated)

{com}. replace DayCasMeRaA11S01XBC = . if provincestate != "British Columbia"
{txt}(963 real changes made, 963 to missing)

{com}. 
. gen DayCasMeRaA11S01XMB = DayCasMeRaA11S01
{txt}(831 missing values generated)

{com}. replace DayCasMeRaA11S01XMB = . if provincestate != "Manitoba"
{txt}(948 real changes made, 948 to missing)

{com}. 
. gen DayCasMeRaA11S01XON = DayCasMeRaA11S01
{txt}(831 missing values generated)

{com}. replace DayCasMeRaA11S01XON = . if provincestate != "Ontario"
{txt}(949 real changes made, 949 to missing)

{com}. 
. gen DayCasMeRaA11S01XQC = DayCasMeRaA11S01
{txt}(831 missing values generated)

{com}. replace DayCasMeRaA11S01XQC = . if provincestate != "Quebec"
{txt}(961 real changes made, 961 to missing)

{com}.  
. gen DayCasMeRaA11S01XSK = DayCasMeRaA11S01
{txt}(831 missing values generated)

{com}. replace DayCasMeRaA11S01XSK = . if provincestate != "Saskatchewan" 
{txt}(963 real changes made, 963 to missing)

{com}. 
. gen DayCasMeRaA11S01XXX = DayCasMeRaA11S01
{txt}(831 missing values generated)

{com}. replace DayCasMeRaA11S01XXX = . if provincestate != " National" 
{txt}(801 real changes made, 801 to missing)

{com}. 
. 
. compress
  {txt}variable {bf}DayCasMeRaA11S01XAB{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayCasMeRaA11S01XBC{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayCasMeRaA11S01XMB{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayCasMeRaA11S01XON{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayCasMeRaA11S01XQC{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayCasMeRaA11S01XSK{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}DayCasMeRaA11S01XXX{sf} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
{txt}  (26,908 bytes saved)

{com}. 
. save "CovidVisualizedCountry PHAC.dta", replace
{txt}file CovidVisualizedCountry PHAC.dta saved

{com}. 
. 
. 
. 
. * add JOHN
. 
. 
. cd ..
{res}/Users/farshadpourmalek/Downloads/CovidVisualizedCountry-main/20210910/code
{txt}
{com}. 
. cd JOHN
{res}/Users/farshadpourmalek/Downloads/CovidVisualizedCountry-main/20210910/code/JOHN
{txt}
{com}. 
. use "CovidVisualizedCountry JOHN.dta", clear 
{txt}
{com}. 
. cd .. 
{res}/Users/farshadpourmalek/Downloads/CovidVisualizedCountry-main/20210910/code
{txt}
{com}. 
. cd PHAC
{res}/Users/farshadpourmalek/Downloads/CovidVisualizedCountry-main/20210910/code/PHAC
{txt}
{com}. 
. save "CovidVisualizedCountry JOHN.dta", replace 
{txt}file CovidVisualizedCountry JOHN.dta saved

{com}. 
. use "CovidVisualizedCountry PHAC.dta", clear 
{txt}
{com}. 
. drop _merge
{txt}
{com}. 
. merge m:m provincestate date using "CovidVisualizedCountry JOHN.dta"
{res}{txt}{p 0 7 2}
(note: variable
provincestate was 
str16, now str25 to accommodate using data's values)
{p_end}

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}           8,090
{txt}{col 9}from master{col 30}{res}             820{txt}  (_merge==1)
{col 9}from using{col 30}{res}           7,270{txt}  (_merge==2)

{col 5}matched{col 30}{res}           1,102{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge
{txt}
{com}. 
. save "CovidVisualizedCountry PHAC.dta", replace
{txt}file CovidVisualizedCountry PHAC.dta saved

{com}. 
. 
. 
. 
. * Daily hospitalization rate to Daily hospitalization number
. 
. 
. /*
> 
> Statistics Canada
> 
> https://www150.statcan.gc.ca/t1/tbl1/en/tv.action?pid=1710000901
> 
> Population estimates, quarterly
> 
> Table: 17-10-0009-01 (formerly CANSIM 051-0005)
> 
> Release date: 2021-06-17
> 
> Population of Canada 2021 Q2 = 38,131,104
> 
> */
. 
. gen national_pop = 38131104
{txt}
{com}. 
. gen DayHOSMeSmA11S01 = (DayHosMeSmA11S01 * 38131104) / 100000
{txt}(8,126 missing values generated)

{com}. 
. label var DayHOSMeSmA11S01 "Daily Hospitalized cases number reference scenario"
{txt}
{com}. 
. gen DayHOSMeSmA11S02 = (DayHosMeSmA11S02 * 38131104) / 100000
{txt}(8,126 missing values generated)

{com}. 
. label var DayHOSMeSmA11S02 "Daily Hospitalized cases number better scenario"
{txt}
{com}. 
. gen DayCAPMeRaA11S00 = (DayCapMeRaA11S00 * 38131104) / 100000
{txt}(8,126 missing values generated)

{com}. 
. label var DayHOSMeSmA11S02 "Hospital capacity number for C-19 patients"
{txt}
{com}. 
. 
. save "CovidVisualizedCountry PHAC.dta", replace
{txt}file CovidVisualizedCountry PHAC.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
.  
. 
. ********************
.                                                                 
. * graphs                                                                
.                                                                 
.                                                                 
. grstyle init
{res}{txt}
{com}. 
. grstyle color background white
{txt}
{com}. 
. 
. use "CovidVisualizedCountry PHAC.dta", clear 
{txt}
{com}. 
. *****************
. * daily cases (graph numbers starting with 31)
. 
. 
. 
. ****
. * daily cases, reference scenarios, all time, National, PHAC
. 
. twoway ///
> (line DayCasMeRaA11S02 date, sort lwidth(thick) lcolor(green)) /// "Better scenario"
> (line DayCasMeRaA11S03 date, sort lwidth(thick) lcolor(red)) /// "Worse scenario"
> (line DayCasMeRaA11S01 date, sort lwidth(thick) lcolor(black)) /// "Reference scenario"
> if date >= td(01jan2021) & date <= td(01nov2021) & provincestate == " National" ///
> , xtitle(Date) xlabel(#5, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases or infections) title("COVID-19 daily cases, $country, National, PHAC", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Better" 2 "Worse" 3 "Reference") size(small) row(1)) ///
> subtitle("three scenarios, PHAC-McMaster model", size(small)) 
{res}{txt}
{com}. 
. qui graph save "CAN4 31aDayCasMERGnat alltime - COVID-19 daily cases, $country, National, three scenarios PHAC.gph", replace
{txt}
{com}. qui graph export "CAN4 31aDayCasMERGnat alltime - COVID-19 daily cases, $country, National, three scenarios PHAC.pdf", replace
{txt}
{com}. 
. 
. 
. 
. ****
. * daily cases, reference scenarios, all time, National, PHAC, 21-09-01 on
. 
. twoway ///
> (line DayCasMeRaA11S02 date, sort lwidth(thick) lcolor(green)) /// "Better scenario"
> (line DayCasMeRaA11S03 date, sort lwidth(thick) lcolor(red)) /// "Worse scenario"
> (line DayCasMeRaA11S01 date, sort lwidth(thick) lcolor(black)) /// "Reference scenario"
> if date >= td(01sep2021) & date <= td(01nov2021) & provincestate == " National" ///
> , xtitle(Date) xlabel(#3, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases or infections) title("COVID-19 daily cases, $country, National, PHAC", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Better" 2 "Worse" 3 "Reference") size(small) row(1)) ///
> subtitle("three scenarios, PHAC-McMaster model", size(small)) 
{res}{txt}
{com}. 
. qui graph save "CAN4 31bDayCasMERGnat alltime - COVID-19 daily cases, $country, National, three scenarios PHAC 21-09-01 on.gph", replace
{txt}
{com}. qui graph export "CAN4 31bDayCasMERGnat alltime - COVID-19 daily cases, $country, National, three scenarios PHAC 21-09-01 on.pdf", replace
{txt}
{com}. 
. 
. 
. 
. ****
. * daily cases, reference scenarios, all time, National, PHAC, CI
. 
. twoway ///
> (line DayCasMeRaA11S02 date, sort lwidth(thick) lcolor(green)) /// "Better scenario" mean
> (line DayCasLoRaA11S02 date, sort lwidth(thick) lcolor(green) lwidth(medium) lpattern(dash)) /// "Better scenario" lower
> (line DayCasUpRaA11S02 date, sort lwidth(thick) lcolor(green) lwidth(medium) lpattern(dash)) /// "Better scenario" upper
> (line DayCasMeRaA11S03 date, sort lwidth(thick) lcolor(red)) /// "Worse scenario"
> (line DayCasLoRaA11S03 date, sort lwidth(thick) lcolor(red) lwidth(medium) lpattern(dash)) /// "Worse scenario" lower
> (line DayCasUpRaA11S03 date, sort lwidth(thick) lcolor(red) lwidth(medium) lpattern(dash)) /// "Worse scenario" upper
> (line DayCasMeRaA11S01 date, sort lwidth(thick) lcolor(black)) /// "Reference scenario"
> (line DayCasLoRaA11S01 date, sort lwidth(thick) lcolor(black) lwidth(medium) lpattern(dash)) /// "Reference scenario" lower
> (line DayCasUpRaA11S01 date, sort lwidth(thick) lcolor(black) lwidth(medium) lpattern(dash)) /// "WoReferencerse scenario" upper
> if date >= td(01jan2021) & date <= td(01nov2021) & provincestate == " National" ///
> & DayCasLoRaA11S01 != . & DayCasUpRaA11S01 != . ///
> , xtitle(Date) xlabel(#5, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases or infections) title("COVID-19 daily cases, $country, National, PHAC", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Better" 4 "Worse" 7 "Reference") size(small) row(1)) ///
> subtitle("three scenarios, PHAC-McMaster model", size(small)) ///
> note("Uncertainty limits: dashed (– – –) curves") 
{res}{txt}
{com}. 
. qui graph save "CAN4 31cDayCasMERGnat alltime - COVID-19 daily cases, $country, National, three scenarios PHAC CI.gph", replace
{txt}
{com}. qui graph export "CAN4 31cDayCasMERGnat alltime - COVID-19 daily cases, $country, National, three scenarios PHAC CI.pdf", replace
{txt}
{com}. 
. 
. 
. 
. 
. ****
. * daily cases, reference scenarios, all time, National, PHAC, CI, 21-09-01 on
. 
. twoway ///
> (line DayCasMeRaA11S02 date, sort lwidth(thick) lcolor(green)) /// "Better scenario" mean
> (line DayCasLoRaA11S02 date, sort lwidth(thick) lcolor(green) lwidth(medium) lpattern(dash)) /// "Better scenario" lower
> (line DayCasUpRaA11S02 date, sort lwidth(thick) lcolor(green) lwidth(medium) lpattern(dash)) /// "Better scenario" upper
> (line DayCasMeRaA11S03 date, sort lwidth(thick) lcolor(red)) /// "Worse scenario"
> (line DayCasLoRaA11S03 date, sort lwidth(thick) lcolor(red) lwidth(medium) lpattern(dash)) /// "Worse scenario" lower
> (line DayCasUpRaA11S03 date, sort lwidth(thick) lcolor(red) lwidth(medium) lpattern(dash)) /// "Worse scenario" upper
> (line DayCasMeRaA11S01 date, sort lwidth(thick) lcolor(black)) /// "Reference scenario"
> (line DayCasLoRaA11S01 date, sort lwidth(thick) lcolor(black) lwidth(medium) lpattern(dash)) /// "Reference scenario" lower
> (line DayCasUpRaA11S01 date, sort lwidth(thick) lcolor(black) lwidth(medium) lpattern(dash)) /// "WoReferencerse scenario" upper
> if date >= td(01sep2021) & date <= td(01nov2021) & provincestate == " National" ///
> & DayCasLoRaA11S01 != . & DayCasUpRaA11S01 != . ///
> , xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases or infections) title("COVID-19 daily cases, $country, National, PHAC", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Better" 4 "Worse" 7 "Reference") size(small) row(1)) ///
> subtitle("three scenarios, PHAC-McMaster model", size(small)) ///
> note("Uncertainty limits: dashed (– – –) curves") 
{res}{txt}
{com}. 
. qui graph save "CAN4 31dDayCasMERGnat alltime - COVID-19 daily cases, $country, National, three scenarios PHAC CI 21-09-01 on.gph", replace
{txt}
{com}. qui graph export "CAN4 31dDayCasMERGnat alltime - COVID-19 daily cases, $country, National, three scenarios PHAC CI 21-09-01 on.pdf", replace
{txt}
{com}. 
. 
. 
. 
. 
. ****
. * daily cases, three scenarios, all time, by province, PHAC
. 
. levelsof provincestate, local(levels)
{txt}`" National"' `"Alberta"' `"British Columbia"' `"Manitoba"' `"New Brunswick"' `"Newfoundland and Labrador"' `"Northwest Territories"' `"Nova Scotia"' `"Nunavut"' `"Ontario"' `"Prince Edward Island"' `"Quebec"' `"Saskatchewan"' `"Yukon"'

{com}. 
. foreach l of local levels {c -(}
{txt}  2{com}. 
. twoway ///
> (line DayCasMeRaA11S02 date, sort lwidth(thick) lcolor(green)) /// "Better scenario"
> (line DayCasMeRaA11S03 date, sort lwidth(thick) lcolor(red)) /// "Worse scenario"
> (line DayCasMeRaA11S01 date, sort lwidth(thick) lcolor(black)) /// "Reference scenario"
> if date >= td(15jun2021) & date <= td(01nov2021) & provincestate == "`l'" ///
> , xtitle(Date) xlabel(#5, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases or infections) title("COVID-19 daily cases, $country, `l', PHAC", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Reference" 2 "Better" 3 "Worse") size(small) row(1)) ///
> subtitle("three scenarios, PHAC-McMaster model", size(small)) 
{txt}  3{com}. 
. qui graph save "SUB4 31bDayCasMERGsub alltime `l' - COVID-19 daily cases, $country, `l', three scenarios PHAC.gph", replace
{txt}  4{com}. qui graph export "SUB4 31bDayCasMERGsub alltime `l' - COVID-19 daily cases, $country, `l', three scenarios PHAC.pdf", replace
{txt}  5{com}. 
. {c )-}
{res}{txt}
{com}. *
. 
. 
. 
. 
. ****
. * daily cases, three scenarios, all time, by province, PHAC, CI
. 
. levelsof provincestate, local(levels)
{txt}`" National"' `"Alberta"' `"British Columbia"' `"Manitoba"' `"New Brunswick"' `"Newfoundland and Labrador"' `"Northwest Territories"' `"Nova Scotia"' `"Nunavut"' `"Ontario"' `"Prince Edward Island"' `"Quebec"' `"Saskatchewan"' `"Yukon"'

{com}. 
. foreach l of local levels {c -(}
{txt}  2{com}. 
. twoway ///
> (line DayCasMeRaA11S02 date, sort lwidth(thick) lcolor(green)) /// "Better scenario" mean
> (line DayCasLoRaA11S02 date, sort lwidth(thick) lcolor(green) lwidth(medium) lpattern(dash)) /// "Better scenario" lower
> (line DayCasUpRaA11S02 date, sort lwidth(thick) lcolor(green) lwidth(medium) lpattern(dash)) /// "Better scenario" upper
> (line DayCasMeRaA11S03 date, sort lwidth(thick) lcolor(red)) /// "Worse scenario"
> (line DayCasLoRaA11S03 date, sort lwidth(thick) lcolor(red) lwidth(medium) lpattern(dash)) /// "Worse scenario" lower
> (line DayCasUpRaA11S03 date, sort lwidth(thick) lcolor(red) lwidth(medium) lpattern(dash)) /// "Worse scenario" upper
> (line DayCasMeRaA11S01 date, sort lwidth(thick) lcolor(black)) /// "Reference scenario"
> (line DayCasLoRaA11S01 date, sort lwidth(thick) lcolor(black) lwidth(medium) lpattern(dash)) /// "Reference scenario" lower
> (line DayCasUpRaA11S01 date, sort lwidth(thick) lcolor(black) lwidth(medium) lpattern(dash)) /// "WoReferencerse scenario" upper
> if date >= td(15jun2021) & date <= td(01nov2021) & provincestate == "`l'" ///
> , xtitle(Date) xlabel(#5, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases or infections) title("COVID-19 daily cases, $country, `l', PHAC", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Better" 4 "Worse" 7 "Reference") size(small) row(1)) ///
> subtitle("three scenarios, PHAC-McMaster model", size(small)) ///
> note("Uncertainty limits: dashed (– – –) curves") 
{txt}  3{com}. 
. qui graph save "SUB4 31cDayCasMERGsub alltime `l' - COVID-19 daily cases, $country, `l', three scenarios PHAC CI.gph", replace
{txt}  4{com}. qui graph export "SUB4 31cDayCasMERGsub alltime `l' - COVID-19 daily cases, $country, `l', three scenarios PHAC CI.pdf", replace
{txt}  5{com}. 
. {c )-}
{res}{txt}
{com}. *
. 
. 
. 
. ****
. * daily cases, national, all subnational, reference scenario, PHAC 
. 
. twoway ///
> (line DayCasMeRaA11S01XAB date, sort lwidth(medium) lcolor(cyan)) /// 1 "AB" cyan
> (line DayCasMeRaA11S01XBC date, sort lwidth(medium) lcolor(blue)) /// 2 "BC" blue
> (line DayCasMeRaA11S01XMB date, sort lwidth(medium) lcolor(lime)) /// 3 "MB" lime
> (line DayCasMeRaA11S01XON date, sort lwidth(medium) lcolor(red)) /// 4 "ON" red
> (line DayCasMeRaA11S01XQC date, sort lwidth(medium) lcolor(black)) /// 5 "QC" black
> (line DayCasMeRaA11S01XSK date, sort lwidth(medium) lcolor(orange)) /// 6 "SK" orange
> (line DayCasMeRaA11S01XXX date, sort lwidth(thick) lcolor(gray)) /// 7 "CAN" 
> if date >= td(15jun2021) & date <= td(01nov2021) ///
> , xtitle(Date) xlabel(#6, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(forty_five)) ///
> ytitle("Daily cases") title("COVID-19 cases, $country, reference scenario, PHAC", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "AB" 2 "BC" 3 "MB" 4 "ON" 5 "QC" 6 "SK" 7 "CAN") rows(2) size(small)) ///
> subtitle("reference scenario, PHAC-McMaster model", size(small)) 
{res}{txt}
{com}. 
. qui graph save "CAN11 19aDayDeaRATE alltime IHME - COVID-19 daily cases, $country, subnational together, reference scenario PHAC.gph", replace
{txt}
{com}. qui graph export "CAN11 19aDayDeaRATE alltime IHME - COVID-19 daily cases, $country, subnational together, reference scenario PHAC.pdf", replace
{txt}
{com}. 
. 
. 
. 
. 
. 
. ****
. * daily cases, all subnational, reference scenario, PHAC 
. 
. twoway ///
> (line DayCasMeRaA11S01XAB date, sort lwidth(medium) lcolor(cyan)) /// 1 "AB" cyan
> (line DayCasMeRaA11S01XBC date, sort lwidth(medium) lcolor(blue)) /// 2 "BC" blue
> (line DayCasMeRaA11S01XMB date, sort lwidth(medium) lcolor(lime)) /// 3 "MB" lime
> (line DayCasMeRaA11S01XON date, sort lwidth(medium) lcolor(red)) /// 4 "ON" red
> (line DayCasMeRaA11S01XQC date, sort lwidth(medium) lcolor(black)) /// 5 "QC" black
> (line DayCasMeRaA11S01XSK date, sort lwidth(medium) lcolor(orange)) /// 6 "SK" orange
> if date >= td(15jun2021) & date <= td(01nov2021) ///
> , xtitle(Date) xlabel(#6, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(forty_five)) ///
> ytitle("Daily cases") title("COVID-19 cases, $country, reference scenario, PHAC", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "AB" 2 "BC" 3 "MB" 4 "ON" 5 "QC" 6 "SK") rows(2) size(small)) ///
> subtitle("reference scenario, PHAC-McMaster model", size(small)) 
{res}{txt}
{com}. 
. qui graph save "CAN11 19bDayDeaRATE alltime IHME - COVID-19 daily cases, $country, subnational together, reference scenario PHAC.gph", replace
{txt}
{com}. qui graph export "CAN11 19bDayDeaRATE alltime IHME - COVID-19 daily cases, $country, subnational together, reference scenario PHAC.pdf", replace
{txt}
{com}. 
. 
. 
. 
. ************************
. 
. * other outcomes (graph numbers start with 71)
. 
. 
. *****
. * daily hospital-related outcomes, National, PHAC
. 
. twoway ///
> (line DayHosMeSmA11S01 date, sort lcolor(black)) /// 
> (line DayHosMeSmA11S02 date, sort lcolor(green)) /// 
> (line DayCapMeRaA11S00 date, sort lcolor(red)) /// 
> if date >= td(01feb2020) & date <= td(01jan2023) & provincestate == " National" ///
> , xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily hospitalized cases per 100K pop) title("COVID-19 Daily hospitalized cases per 100K pop, $country, `l', PHAC", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Reference" 2 "Better" 3 "Capacity") size(small) row(1)) ///
> subtitle("two scenarios, PHAC-McMaster model", size(small)) 
{res}{txt}
{com}. 
. qui graph save "CAN7 71aDayHosMERGnat alltime - COVID-19 hospital-related outcomes, $country, National.gph", replace
{txt}
{com}. qui graph export "CAN7 71aDayHosMERGnat  alltime - COVID-19 hospital-related outcomes, $country, National.pdf", replace
{txt}
{com}. 
. 
. 
. 
. *****
. * daily hospital-related outcomes, National, PHAC, 21-09-01 to 22-01-01
. 
. twoway ///
> (line DayHosMeSmA11S01 date, sort lcolor(black)) /// 
> (line DayHosMeSmA11S02 date, sort lcolor(green)) /// 
> (line DayCapMeRaA11S00 date, sort lcolor(red)) /// 
> if date >= td(01sep2021) & date <= td(01jan2022) & provincestate == " National" ///
> , xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily hospitalized cases per 100K pop) title("COVID-19 Daily hospitalized cases per 100K pop, $country, `l', PHAC", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Reference" 2 "Better" 3 "Capacity") size(small) row(1)) ///
> subtitle("two scenarios, 21-09-01 to 22-01-01, PHAC-McMaster model", size(small)) 
{res}{txt}
{com}. 
. qui graph save "CAN7 71bDayHosMERGnat alltime - COVID-19 hospital-related outcomes, $country, National 21-09-01 to 22-01-01.gph", replace
{txt}
{com}. qui graph export "CAN7 71bDayHosMERGnat  alltime - COVID-19 hospital-related outcomes, $country, National 21-09-01 to 22-01-01.pdf", replace
{txt}
{com}. 
. 
. 
. 
. 
. *****
. * daily hospital-related outcomes, National, PHAC, 21-09-01 to 22-01-01 wo capacity
. 
. twoway ///
> (line DayHosMeSmA11S01 date, sort lcolor(black)) /// 
> (line DayHosMeSmA11S02 date, sort lcolor(green)) /// 
> if date >= td(01sep2021) & date <= td(01jan2022) & provincestate == " National" ///
> , xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily hospitalized cases per 100K pop) title("COVID-19 Daily hospitalized cases per 100K pop, $country, `l', PHAC", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Reference" 2 "Better") size(small) row(1)) ///
> subtitle("two scenarios, 21-09-01 to 22-01-01, PHAC-McMaster model", size(small)) 
{res}{txt}
{com}. 
. qui graph save "CAN7 71cDayHosMERGnat alltime - COVID-19 hospital-related outcomes, $country, National 21-09-01 to 22-01-01 wo capacity.gph", replace
{txt}
{com}. qui graph export "CAN7 71cDayHosMERGnat  alltime - COVID-19 hospital-related outcomes, $country, National 21-09-01 to 22-01-01 wo capacity.pdf", replace
{txt}
{com}. 
. 
. 
. 
. *****
. * daily hospital-related outcomes, National, PHAC, 21-09-01 to 22-01-01, number
. 
. twoway ///
> (line DayHOSMeSmA11S01 date, sort lcolor(black)) /// 
> (line DayHOSMeSmA11S02 date, sort lcolor(green)) /// 
> (line DayCAPMeRaA11S00 date, sort lcolor(red)) /// 
> if date >= td(01sep2021) & date <= td(01jan2022) & provincestate == " National" ///
> , xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily hospitalized cases number) title("COVID-19 Daily hospitalized cases number, $country, `l', PHAC", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Reference" 2 "Better" 3 "Capacity") size(small) row(1)) ///
> subtitle("two scenarios, 21-09-01 to 22-01-01, PHAC-McMaster model", size(small)) 
{res}{txt}
{com}. 
. qui graph save "CAN7 71dDayHosMERGnat alltime - COVID-19 hospital-related outcomes, $country, National 21-09-01 to 22-01-01 number.gph", replace
{txt}
{com}. qui graph export "CAN7 71dDayHosMERGnat  alltime - COVID-19 hospital-related outcomes, $country, National 21-09-01 to 22-01-01 number.pdf", replace
{txt}
{com}. 
. 
. 
. 
. 
. *****
. * daily hospital-related outcomes, National, PHAC, 21-09-01 to 22-01-01 wo capacity, number
. 
. twoway ///
> (line DayHOSMeSmA11S01 date, sort lcolor(black)) /// 
> (line DayHOSMeSmA11S02 date, sort lcolor(green)) /// 
> if date >= td(01sep2021) & date <= td(01jan2022) & provincestate == " National" ///
> , xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily hospitalized cases number) title("COVID-19 Daily hospitalized cases number, $country, `l', PHAC", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Reference" 2 "Better") size(small) row(1)) ///
> subtitle("two scenarios, 21-09-01 to 22-01-01, PHAC-McMaster model", size(small)) 
{res}{txt}
{com}. 
. qui graph save "CAN7 71eDayHosMERGnat alltime - COVID-19 hospital-related outcomes, $country, National 21-09-01 to 22-01-01 wo capacity number.gph", replace
{txt}
{com}. qui graph export "CAN7 71eDayHosMERGnat  alltime - COVID-19 hospital-related outcomes, $country, National 21-09-01 to 22-01-01 wo capacity number.pdf", replace
{txt}
{com}. 
. 
. 
. 
. 
. 
. view "log CovidVisualizedCountry PHAC.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/CovidVisualizedCountry-main/20210910/code/PHAC/log CovidVisualizedCountry PHAC.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}13 Sep 2021, 05:46:05
{txt}{.-}
{smcl}
{txt}{sf}{ul off}